# -*- coding: utf-8 -*-
#---------------------------------------------------------------------------------
#    Заданны неотрицательные целые числа n и M.
#    Вычислить функцию Аккермана пользуясь следующими рекуррентными соотношениями:
#    A(n,m) = m+1,  якщо n=0;
#    A(n,m) = A(n-1,1),  якщо n>0, m=0;
#    A(n,m) = A(n-1, A(n,m-1)),  якщо n>0, m>0
#---------------------------------------------------------------------------------

def input_Values():
    print ('Введите целые неотрицательные n и m: ')
    global n, m
    n = input('n=')
    m = input('m=')
     
    while (int(n)<0):
        n = input('Введите целое неотрицательное n: ')
    while (int(m)<0):
        m = input('Введите целое неотрицательное m: ')

def A (n,m):
    if (int(n)>0 and int(m)>0):
        F = A(int(n)-1, A(int(n),int(m)-1))

    elif (int(n)>0 and int(m)==0):
        F = A(int(n)-1,1)

    else:
        F = int(m)+1

    return F


n = int(0)
m = int(0)
input_Values()
res = A (int(n),int(m))
print(res)